RT-Thread/rt-thread/bsp/apm32/libraries/APM32E10x_Library/APM32E10x_StdPeriphDriver/src/apm32e10x_adc.c
    mask = (uint8_t)interrupt;
    adc->CTRL1 |= (uint8_t)mask;
}

/*!
 * @brief      Disable the specified ADC interrupt.
 *
 * @param      adc: Select the ADC peripheral.
 *
 * @param      interrupt: Select the ADC interrupt sources
 *                        This parameter can be any combination of the following values:
 *                        @arg ADC_INT_AWD    : Disable Analog watchdog interrupt
 *                        @arg ADC_INT_EOC    : Disable End of conversion interrupt
 *                        @arg ADC_INT_INJEOC : Disable End of injected conversion interrupt
 *
 * @retval     None
 *
 * @note       adc can be ADC1, ADC2 or ADC3.
 */
void ADC_DisableInterrupt(ADC_T* adc, uint16_t interrupt)
{
    uint8_t mask;

    mask = (uint8_t)interrupt;
    adc->CTRL1 &= (~(uint32_t)mask);
}

/*!
 * @brief     Reads the specified ADC flag
 *
 * @param     adc: Select the ADC peripheral
 *
 * @param     flag: Select the flag to check
 *                  This parameter can be one of the following values:
 *                  @arg ADC_FLAG_AWD   : Analog watchdog flag
 *                  @arg ADC_FLAG_EOC   : End of conversion flag
 *                  @arg ADC_FLAG_INJEOC: End of injected group conversion flag
 *                  @arg ADC_FLAG_INJCS : Injected group conversion Start flag
 *                  @arg ADC_FLAG_REGCS : Regular group conversion Start flag
 *
 * @retval    The status of ADC flag
 *
 * @note      adc can be ADC1, ADC2 or ADC3.
 */
uint8_t ADC_ReadStatusFlag(ADC_T* adc, ADC_FLAG_T flag)
{
    return (adc->STS & flag) ? SET : RESET;
}

/*!
 * @brief     Clears the specified ADC flag
 *
 * @param     adc: Select the ADC peripheral
 *
 * @param     flag: Select the flag to clear
 *                  This parameter can be any combination of the following values:
 *                  @arg ADC_FLAG_AWD   : Analog watchdog flag
 *                  @arg ADC_FLAG_EOC   : End of conversion flag
 *                  @arg ADC_FLAG_INJEOC: End of injected group conversion flag
 *                  @arg ADC_FLAG_INJCS : Injected group conversion Start flag
 *                  @arg ADC_FLAG_REGCS : Regular group conversion Start flag
 *
 * @retval    None
 *
 * @note      adc can be ADC1, ADC2 or ADC3.
 */
void ADC_ClearStatusFlag(ADC_T* adc, uint8_t flag)
{
    adc->STS = ~(uint32_t)flag;
}

/*!
 * @brief        Reads the specified ADC Interrupt flag.
 *
 * @param        adc: Select the ADC peripheral.
 *
 * @param        interrupt: Select the ADC interrupt source.
 *                          This parameter can be one of the following values:
 *                          @arg ADC_INT_AWD    : Enable Analog watchdog interrupt
 *                          @arg ADC_INT_EOC    : Enable End of conversion interrupt
 *                          @arg ADC_INT_INJEOC : Enable End of injected conversion interrupt
 *
 * @retval       The status of ADC interrupt
 *
 * @note         adc can be ADC1, ADC2 or ADC3.
 */
uint8_t ADC_ReadIntFlag(ADC_T* adc, ADC_INT_T flag)
{
    uint8_t bitStatus = RESET;
    uint32_t itmask = 0;
    uint32_t enableStatus = 0;

    itmask = flag >> 8;
    enableStatus = (adc->CTRL1 & (uint8_t)flag);

    if (((adc->STS & itmask) != (uint32_t)RESET) && enableStatus)
    {
        bitStatus = SET;
    }
    else
    {
        bitStatus = RESET;
    }
    return  bitStatus;
}

/*!
 * @brief        Clears the specified ADC Interrupt pending bits.
 *
 * @param        adc: Select the ADC peripheral.
 *
 * @param        interrupt: Select the ADC interrupt source.
 *                          This parameter can be any combination of the following values:
 *                          @arg ADC_INT_AWD    : Enable Analog watchdog interrupt
 *                          @arg ADC_INT_EOC    : Enable End of conversion interrupt
 *                          @arg ADC_INT_INJEOC : Enable End of injected conversion interrupt
 *
 * @retval       None
 *
 * @note         adc can be ADC1, ADC2 or ADC3.
 */
void ADC_ClearIntFlag(ADC_T* adc, uint16_t flag)
{
  uint8_t mask = 0;

    mask = (uint8_t)(flag >> 8);
    adc->STS = ~(uint32_t)mask;
}

/**@} end of group ADC_Functions */
/**@} end of group ADC_Driver */
/**@} end of group APM32E10x_StdPeriphDriver */
